package com.atguigu.designPattern03;

/**
 * Create by koala on 2021-03-23
 * 设计模式：
 *      1、设计模式（Design pattern）代表了最佳的实践
 *      2、设计模式的本质提高软件的维护性，通用性和扩展性，并降低软件的复杂度
 *
 * 设计模式类型：
 *      1) 创建型模式：单例模式、抽象工厂模式、原型模式、建造者模式、工厂模式
 *      2) 结构型模式：适配器模式、桥接模式、装饰模式、组合模式、外观模式、享元模式、代理模式
 *      3) 行为型模式：模版方法模式、命令模式、访问者模式、迭代器模式、观察者模式、中介者模式、备忘录模式、
 *          解释器模式（Interpreter模式）、状态模式、策略模式、职责链模式(责任链模式)
 *
 *  需要重点掌握的设计模式：
 *      1、单例模式
 *      2、工厂模式
 *      3、代理模式
 *      4、装饰模式
 *      5、观察者模式
 */
public class day00designPattern {
}
